// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.

Console.Clear();
string input = "Hello World , Road to IT";
string result = input.ToLower();
Console.WriteLine($"{result}");
